MCUSec/IPEA/fw_samples/frdmk64f-sdk_v2.11.0/devices/MK64F12/drivers/fsl_sdhc.c
/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief SDHC internal handle pointer array */
static sdhc_handle_t *s_sdhcHandle[FSL_FEATURE_SOC_SDHC_COUNT];

/*! @brief SDHC base pointer array */
static SDHC_Type *const s_sdhcBase[] = SDHC_BASE_PTRS;

/*! @brief SDHC IRQ name array */
static const IRQn_Type s_sdhcIRQ[] = SDHC_IRQS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! @brief SDHC clock array name */
static const clock_ip_name_t s_sdhcClock[] = SDHC_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/* SDHC ISR for transactional APIs. */
#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
static sdhc_isr_t s_sdhcIsr = (sdhc_isr_t)DefaultISR;
#else
static sdhc_isr_t s_sdhcIsr;
#endif

/*******************************************************************************
 * Code
 ******************************************************************************/
static uint32_t SDHC_GetInstance(SDHC_Type *base)
{
    uint8_t instance = 0;

    while ((instance < ARRAY_SIZE(s_sdhcBase)) && (s_sdhcBase[instance] != base))
    {
        instance++;
    }

    assert(instance < ARRAY_SIZE(s_sdhcBase));

    return instance;
}

static void SDHC_StartTransfer(SDHC_Type *base, sdhc_command_t *command, sdhc_data_t *data, sdhc_dma_mode_t dmaMode)
{
    uint32_t flags                            = 0U;
    sdhc_transfer_config_t sdhcTransferConfig = {0};

    /* Define the flag corresponding to each response type. */
    if (command->responseType == kCARD_ResponseTypeR1) /* Response 1 */
    {
        flags |= ((uint32_t)kSDHC_ResponseLength48Flag | (uint32_t)kSDHC_EnableCrcCheckFlag |
                  (uint32_t)kSDHC_EnableIndexCheckFlag);
    }
    else if (command->responseType == kCARD_ResponseTypeR1b) /* Response 1 with busy */
    {
        flags |= ((uint32_t)kSDHC_ResponseLength48BusyFlag | (uint32_t)kSDHC_EnableCrcCheckFlag |
                  (uint32_t)kSDHC_EnableIndexCheckFlag);
    }
    else if (command->responseType == kCARD_ResponseTypeR2) /* Response 2 */
    {
        flags |= ((uint32_t)kSDHC_ResponseLength136Flag | (uint32_t)kSDHC_EnableCrcCheckFlag);
    }
    else if (command->responseType == kCARD_ResponseTypeR3) /* Response 3 */
    {
        flags |= ((uint32_t)kSDHC_ResponseLength48Flag);
    }
    else if (command->responseType == kCARD_ResponseTypeR4) /* Response 4 */
    {
        flags |= ((uint32_t)kSDHC_ResponseLength48Flag);
    }
    else if (command->responseType == kCARD_ResponseTypeR5) /* Response 5 */
    {
        flags |= ((uint32_t)kSDHC_ResponseLength48Flag | (uint32_t)kSDHC_EnableCrcCheckFlag |
                  (uint32_t)kSDHC_EnableIndexCheckFlag);
    }
    else if (command->responseType == kCARD_ResponseTypeR5b) /* Response 5 with busy */
    {
        flags |= ((uint32_t)kSDHC_ResponseLength48BusyFlag | (uint32_t)kSDHC_EnableCrcCheckFlag |
                  (uint32_t)kSDHC_EnableIndexCheckFlag);
    }
    else if (command->responseType == kCARD_ResponseTypeR6) /* Response 6 */
    {
        flags |= ((uint32_t)kSDHC_ResponseLength48Flag | (uint32_t)kSDHC_EnableCrcCheckFlag |
                  (uint32_t)kSDHC_EnableIndexCheckFlag);
    }
    else if (command->responseType == kCARD_ResponseTypeR7) /* Response 7 */
    {
        flags |= ((uint32_t)kSDHC_ResponseLength48Flag | (uint32_t)kSDHC_EnableCrcCheckFlag |
                  (uint32_t)kSDHC_EnableIndexCheckFlag);
    }
    else
    {
        /* Intentional empty for kCARD_ResponseTypeNone */
    }

    if (command->type == kCARD_CommandTypeAbort)
    {
        flags |= (uint32_t)kSDHC_CommandTypeAbortFlag;
    }

    if (data != NULL)
    {
        flags |= (uint32_t)kSDHC_DataPresentFlag;

        if (dmaMode != kSDHC_DmaModeNo)
        {
            flags |= (uint32_t)kSDHC_EnableDmaFlag;
        }

        if (data->rxData != NULL)
        {
            flags |= (uint32_t)kSDHC_DataReadFlag;
        }
        if (data->blockCount > 1U)
        {
            flags |= ((uint32_t)kSDHC_MultipleBlockFlag | (uint32_t)kSDHC_EnableBlockCountFlag);
            if (data->enableAutoCommand12)
            {
                /* Enable Auto command 12. */
                flags |= (uint32_t)kSDHC_EnableAutoCommand12Flag;
            }
        }

        sdhcTransferConfig.dataBlockSize  = data->blockSize;
        sdhcTransferConfig.dataBlockCount = data->blockCount;
    }
    else
    {
        sdhcTransferConfig.dataBlockSize  = 0U;
        sdhcTransferConfig.dataBlockCount = 0U;
    }

    sdhcTransferConfig.commandArgument = command->argument;
    sdhcTransferConfig.commandIndex    = command->index;
    sdhcTransferConfig.flags           = flags;
    SDHC_SetTransferConfig(base, &sdhcTransferConfig);
}

static status_t SDHC_ReceiveCommandResponse(SDHC_Type *base, sdhc_command_t *command)
{
    assert(command != NULL);

    uint32_t response0 = base->CMDRSP[0];
    uint32_t response1 = base->CMDRSP[1];
    uint32_t response2 = base->CMDRSP[2];

    if (command->responseType != kCARD_ResponseTypeNone)
    {
        command->response[0U] = response0;
        if (command->responseType == kCARD_ResponseTypeR2)
        {
            /* R3-R2-R1-R0(lowest 8 bit is invalid bit) has the same format as R2 format in SD specification document
            after removed internal CRC7 and end bit. */
            command->response[0U] <<= 8U;
            command->response[1U] = (response1 << 8U) | ((response0 & 0xFF000000U) >> 24U);
            command->response[2U] = (response2 << 8U) | ((response1 & 0xFF000000U) >> 24U);
            command->response[3U] = (base->CMDRSP[3] << 8U) | ((response2 & 0xFF000000U) >> 24U);
        }
    }

    /* check response error flag */
    if ((command->responseErrorFlags != 0U) &&
        ((command->responseType == kCARD_ResponseTypeR1) || (command->responseType == kCARD_ResponseTypeR1b) ||
         (command->responseType == kCARD_ResponseTypeR6) || (command->responseType == kCARD_ResponseTypeR5)))
    {
        if (((command->responseErrorFlags) & (command->response[0U])) != 0U)
        {
            return kStatus_SDHC_SendCommandFailed;
        }
    }

    return kStatus_Success;
}

static uint32_t SDHC_ReadDataPort(SDHC_Type *base, sdhc_data_t *data, uint32_t transferredWords)
{
    uint32_t i;
    uint32_t totalWords;
    uint32_t wordsCanBeRead; /* The words can be read at this time. */
    uint32_t readWatermark = ((base->WML & SDHC_WML_RDWML_MASK) >> SDHC_WML_RDWML_SHIFT);

