MCUSec/IPEA/fw_samples/frdmk64f-sdk_v2.11.0/devices/MK64F12/drivers/fsl_sdhc.c
    /* Wait data complete or SDHC encounters error. */
    while (!(IS_SDHC_FLAG_SET(
        SDHC_GetInterruptStatusFlags(base),
        ((uint32_t)kSDHC_DataCompleteFlag | (uint32_t)kSDHC_DataErrorFlag | (uint32_t)kSDHC_DmaErrorFlag))))
    {
    }
    if (IS_SDHC_FLAG_SET(SDHC_GetInterruptStatusFlags(base),
                         ((uint32_t)kSDHC_DataErrorFlag | (uint32_t)kSDHC_DmaErrorFlag)))
    {
        if (!(data->enableIgnoreError))
        {
            error = kStatus_Fail;
        }
    }
    SDHC_ClearInterruptStatusFlags(base, ((uint32_t)kSDHC_DataCompleteFlag | (uint32_t)kSDHC_DmaCompleteFlag |
                                          (uint32_t)kSDHC_DataErrorFlag | (uint32_t)kSDHC_DmaErrorFlag));

    return error;
}

#if defined FSL_SDHC_ENABLE_ADMA1
#define SDHC_TransferByAdma1Blocking(base, data) SDHC_TransferByAdma2Blocking(base, data)
#endif /* FSL_SDHC_ENABLE_ADMA1 */

static status_t SDHC_TransferDataBlocking(sdhc_dma_mode_t dmaMode, SDHC_Type *base, sdhc_data_t *data)
{
    status_t error = kStatus_Success;

    if (dmaMode == kSDHC_DmaModeNo)
    {
        error = SDHC_TransferByDataPortBlocking(base, data);
        if (error != kStatus_Success)
        {
            return error;
        }
    }
#if defined FSL_SDHC_ENABLE_ADMA1
    else if (dmaMode == kSDHC_DmaModeAdma1)
    {
        error = SDHC_TransferByAdma1Blocking(base, data);
        if (error != kStatus_Success)
        {
            return error;
        }
    }
#endif /* FSL_SDHC_ENABLE_ADMA1 */

    /*kSDHC_DmaModeAdma2*/
    else
    {
        error = SDHC_TransferByAdma2Blocking(base, data);
        if (error != kStatus_Success)
        {
            return error;
        }
    }

    return kStatus_Success;
}

static void SDHC_TransferHandleCardDetect(SDHC_Type *base, sdhc_handle_t *handle, uint32_t interruptFlags)
{
    if (IS_SDHC_FLAG_SET(interruptFlags, kSDHC_CardInsertionFlag))
    {
        if (handle->callback.CardInserted != NULL)
        {
            handle->callback.CardInserted(base, handle->userData);
        }
    }
    else
    {
        if (handle->callback.CardRemoved != NULL)
        {
            handle->callback.CardRemoved(base, handle->userData);
        }
    }
}

static void SDHC_TransferHandleCommand(SDHC_Type *base, sdhc_handle_t *handle, uint32_t interruptFlags)
{
    assert(handle->command != NULL);

    if ((IS_SDHC_FLAG_SET(interruptFlags, kSDHC_CommandErrorFlag)) && (handle->data == NULL) &&
        (handle->callback.TransferComplete != NULL))
    {
        handle->callback.TransferComplete(base, handle, kStatus_SDHC_SendCommandFailed, handle->userData);
    }
    else
    {
        /* Receive response */
        if (kStatus_Success != SDHC_ReceiveCommandResponse(base, handle->command))
        {
            if (handle->callback.TransferComplete != NULL)
            {
                handle->callback.TransferComplete(base, handle, kStatus_SDHC_SendCommandFailed, handle->userData);
            }
        }
        else
        {
            if (handle->callback.TransferComplete != NULL)
            {
                handle->callback.TransferComplete(base, handle, kStatus_SDHC_TransferCommandComplete, handle->userData);
            }
        }
    }

    SDHC_DisableInterruptSignal(base, kSDHC_CommandFlag);
    handle->command = NULL;
}

static void SDHC_TransferHandleData(SDHC_Type *base, sdhc_handle_t *handle, uint32_t interruptFlags)
{
    assert(handle->data != NULL);

    status_t transferStatus   = kStatus_SDHC_BusyTransferring;
    uint32_t transferredWords = handle->transferredWords;

    if ((!(handle->data->enableIgnoreError)) &&
        (IS_SDHC_FLAG_SET(interruptFlags, ((uint32_t)kSDHC_DataErrorFlag | (uint32_t)kSDHC_DmaErrorFlag))))
    {
        transferStatus = kStatus_SDHC_TransferDataFailed;
    }
    else
    {
        if (IS_SDHC_FLAG_SET(interruptFlags, kSDHC_BufferReadReadyFlag))
        {
            handle->transferredWords = SDHC_ReadDataPort(base, handle->data, transferredWords);
        }
        else if (IS_SDHC_FLAG_SET(interruptFlags, kSDHC_BufferWriteReadyFlag))
        {
            handle->transferredWords = SDHC_WriteDataPort(base, handle->data, transferredWords);
        }
        else
        {
            /* Intentional empty */
        }

        if (IS_SDHC_FLAG_SET(interruptFlags, kSDHC_DataCompleteFlag))
        {
            transferStatus = kStatus_SDHC_TransferDataComplete;
        }
    }

    if ((transferStatus != kStatus_SDHC_BusyTransferring) && (handle->callback.TransferComplete != NULL))
    {
        handle->callback.TransferComplete(base, handle, transferStatus, handle->userData);
        SDHC_DisableInterruptSignal(base, (uint32_t)kSDHC_DataFlag | (uint32_t)kSDHC_DataDMAFlag);
        handle->data = NULL;
    }
}

static void SDHC_TransferHandleSdioInterrupt(SDHC_Type *base, sdhc_handle_t *handle)
{
    if (handle->callback.SdioInterrupt != NULL)
    {
        handle->callback.SdioInterrupt(base, handle->userData);
    }
}

static void SDHC_TransferHandleSdioBlockGap(SDHC_Type *base, sdhc_handle_t *handle)
{
    if (handle->callback.SdioBlockGap != NULL)
    {
        handle->callback.SdioBlockGap(base, handle->userData);
    }
}

/*!
 * brief SDHC module initialization function.
 *
 * Configures the SDHC according to the user configuration.
 *
 * Example:
   code
   sdhc_config_t config;
   config.cardDetectDat3 = false;
   config.endianMode = kSDHC_EndianModeLittle;
   config.dmaMode = kSDHC_DmaModeAdma2;
   config.readWatermarkLevel = 128U;
   config.writeWatermarkLevel = 128U;
   SDHC_Init(SDHC, &config);
   endcode
 *
 * param base SDHC peripheral base address.
 * param config SDHC configuration information.
 * retval kStatus_Success Operate successfully.
 */
void SDHC_Init(SDHC_Type *base, const sdhc_config_t *config)
{
    assert(config != NULL);
#if !defined FSL_SDHC_ENABLE_ADMA1
    assert(config->dmaMode != kSDHC_DmaModeAdma1);
#endif /* FSL_SDHC_ENABLE_ADMA1 */
    assert((config->writeWatermarkLevel >= 1UL) && (config->writeWatermarkLevel <= 128UL));
    assert((config->readWatermarkLevel >= 1UL) && (config->readWatermarkLevel <= 128UL));

    uint32_t proctl;
    uint32_t wml;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Enable SDHC clock. */
    CLOCK_EnableClock(s_sdhcClock[SDHC_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

