MCUSec/IPEA/fw_samples/frdmk64f-sdk_v2.11.0/devices/MK64F12/drivers/fsl_sdhc.c
    /* Wait until the SD clock is stable. */
    while (!(IS_SDHC_FLAG_SET(base->PRSSTAT, SDHC_PRSSTAT_SDSTB_MASK)))
    {
    }
    /* Enable the SD clock. */
    base->SYSCTL |= SDHC_SYSCTL_SDCLKEN_MASK;

    return nearestFrequency;
}

/*!
 * brief Sends 80 clocks to the card to set it to the active state.
 *
 * This function must be called each time the card is inserted to ensure that the card can receive the command
 * correctly.
 *
 * param base SDHC peripheral base address.
 * param timeout Timeout to initialize card.
 * retval true Set card active successfully.
 * retval false Set card active failed.
 */
bool SDHC_SetCardActive(SDHC_Type *base, uint32_t timeout)
{
    base->SYSCTL |= SDHC_SYSCTL_INITA_MASK;
    /* Delay some time to wait card become active state. */
    while (IS_SDHC_FLAG_SET(base->SYSCTL, SDHC_SYSCTL_INITA_MASK))
    {
        if (timeout == 0UL)
        {
            break;
        }
        timeout--;
    }

    return (timeout == 0UL ? false : true);
}

/*!
 * brief Sets the card transfer-related configuration.
 *
 * This function fills the card transfer-related command argument/transfer flag/data size. The command and data are sent
 by
 * SDHC after calling this function.
 *
 * Example:
   code
   sdhc_transfer_config_t transferConfig;
   transferConfig.dataBlockSize = 512U;
   transferConfig.dataBlockCount = 2U;
   transferConfig.commandArgument = 0x01AAU;
   transferConfig.commandIndex = 8U;
   transferConfig.flags |= (kSDHC_EnableDmaFlag | kSDHC_EnableAutoCommand12Flag | kSDHC_MultipleBlockFlag);
   SDHC_SetTransferConfig(SDHC, &transferConfig);
   endcode
 *
 * param base SDHC peripheral base address.
 * param config Command configuration structure.
 */
void SDHC_SetTransferConfig(SDHC_Type *base, const sdhc_transfer_config_t *config)
{
    assert(config != NULL);
    assert(config->dataBlockSize <= (SDHC_BLKATTR_BLKSIZE_MASK >> SDHC_BLKATTR_BLKSIZE_SHIFT));
    assert(config->dataBlockCount <= (SDHC_BLKATTR_BLKCNT_MASK >> SDHC_BLKATTR_BLKCNT_SHIFT));

    base->BLKATTR = ((base->BLKATTR & ~(SDHC_BLKATTR_BLKSIZE_MASK | SDHC_BLKATTR_BLKCNT_MASK)) |
                     (SDHC_BLKATTR_BLKSIZE(config->dataBlockSize) | SDHC_BLKATTR_BLKCNT(config->dataBlockCount)));
    base->CMDARG  = config->commandArgument;
    base->XFERTYP = (((config->commandIndex << SDHC_XFERTYP_CMDINX_SHIFT) & SDHC_XFERTYP_CMDINX_MASK) |
                     (config->flags & (SDHC_XFERTYP_DMAEN_MASK | SDHC_XFERTYP_MSBSEL_MASK | SDHC_XFERTYP_DPSEL_MASK |
                                       SDHC_XFERTYP_CMDTYP_MASK | SDHC_XFERTYP_BCEN_MASK | SDHC_XFERTYP_CICEN_MASK |
                                       SDHC_XFERTYP_CCCEN_MASK | SDHC_XFERTYP_RSPTYP_MASK | SDHC_XFERTYP_DTDSEL_MASK |
                                       SDHC_XFERTYP_AC12EN_MASK)));
}

/*!
 * brief Enables or disables the SDIO card control.
 *
 * param base SDHC peripheral base address.
 * param mask SDIO card control flags mask(_sdhc_sdio_control_flag).
 * param enable True to enable, false to disable.
 */
void SDHC_EnableSdioControl(SDHC_Type *base, uint32_t mask, bool enable)
{
    uint32_t proctl = base->PROCTL;
    uint32_t vendor = base->VENDOR;

    if (enable)
    {
        if (IS_SDHC_FLAG_SET(mask, kSDHC_StopAtBlockGapFlag))
        {
            proctl |= SDHC_PROCTL_SABGREQ_MASK;
        }
        if (IS_SDHC_FLAG_SET(mask, kSDHC_ReadWaitControlFlag))
        {
            proctl |= SDHC_PROCTL_RWCTL_MASK;
        }
        if (IS_SDHC_FLAG_SET(mask, kSDHC_InterruptAtBlockGapFlag))
        {
            proctl |= SDHC_PROCTL_IABG_MASK;
        }
        if (IS_SDHC_FLAG_SET(mask, kSDHC_ExactBlockNumberReadFlag))
        {
            vendor |= SDHC_VENDOR_EXBLKNU_MASK;
        }
    }
    else
    {
        if (IS_SDHC_FLAG_SET(mask, kSDHC_StopAtBlockGapFlag))
        {
            proctl &= ~SDHC_PROCTL_SABGREQ_MASK;
        }
        if (IS_SDHC_FLAG_SET(mask, kSDHC_ReadWaitControlFlag))
        {
            proctl &= ~SDHC_PROCTL_RWCTL_MASK;
        }
        if (IS_SDHC_FLAG_SET(mask, kSDHC_InterruptAtBlockGapFlag))
        {
            proctl &= ~SDHC_PROCTL_IABG_MASK;
        }
        if (IS_SDHC_FLAG_SET(mask, kSDHC_ExactBlockNumberReadFlag))
        {
            vendor &= ~SDHC_VENDOR_EXBLKNU_MASK;
        }
    }

    base->PROCTL = proctl;
    base->VENDOR = vendor;
}

/*!
 * brief Configures the MMC boot feature.
 *
 * Example:
   code
   sdhc_boot_config_t config;
   config.ackTimeoutCount = 4;
   config.bootMode = kSDHC_BootModeNormal;
   config.blockCount = 5;
   config.enableBootAck = true;
   config.enableBoot = true;
   config.enableAutoStopAtBlockGap = true;
   SDHC_SetMmcBootConfig(SDHC, &config);
   endcode
 *
 * param base SDHC peripheral base address.
 * param config The MMC boot configuration information.
 */
void SDHC_SetMmcBootConfig(SDHC_Type *base, const sdhc_boot_config_t *config)
{
    assert(config != NULL);
    assert(config->ackTimeoutCount <= (SDHC_MMCBOOT_DTOCVACK_MASK >> SDHC_MMCBOOT_DTOCVACK_SHIFT));
    assert(config->blockCount <= (SDHC_MMCBOOT_BOOTBLKCNT_MASK >> SDHC_MMCBOOT_BOOTBLKCNT_SHIFT));

    uint32_t mmcboot = 0U;

    mmcboot = (SDHC_MMCBOOT_DTOCVACK(config->ackTimeoutCount) | SDHC_MMCBOOT_BOOTMODE(config->bootMode) |
               SDHC_MMCBOOT_BOOTBLKCNT(config->blockCount));
    if (config->enableBootAck)
    {
        mmcboot |= SDHC_MMCBOOT_BOOTACK_MASK;
    }
    if (config->enableBoot)
    {
        mmcboot |= SDHC_MMCBOOT_BOOTEN_MASK;
    }
    if (config->enableAutoStopAtBlockGap)
    {
        mmcboot |= SDHC_MMCBOOT_AUTOSABGEN_MASK;
    }
    base->MMCBOOT = mmcboot;
}

/*!
 * brief Sets the ADMA descriptor table configuration.
 *
 * param base SDHC peripheral base address.
 * param dmaMode DMA mode.
 * param table ADMA table address.
 * param tableWords ADMA table buffer length united as Words.
 * param data Data buffer address.
 * param dataBytes Data length united as bytes.
 * retval kStatus_OutOfRange ADMA descriptor table length isn't enough to describe data.
 * retval kStatus_Success Operate successfully.
 */
status_t SDHC_SetAdmaTableConfig(SDHC_Type *base,
                                 sdhc_dma_mode_t dmaMode,
                                 uint32_t *table,
                                 uint32_t tableWords,
                                 const uint32_t *data,
                                 uint32_t dataBytes)
{
    status_t error               = kStatus_Success;
    const uint32_t *startAddress = data;
    uint32_t entries;
    uint32_t i;
#if defined FSL_SDHC_ENABLE_ADMA1
    sdhc_adma1_descriptor_t *adma1EntryAddress;
#endif
    sdhc_adma2_descriptor_t *adma2EntryAddress;

    if ((((table == NULL) || (tableWords == 0UL)) &&
         ((dmaMode == kSDHC_DmaModeAdma1) || (dmaMode == kSDHC_DmaModeAdma2))) ||
        (data == NULL) || (dataBytes == 0UL)
#if !defined FSL_SDHC_ENABLE_ADMA1
        || (dmaMode == kSDHC_DmaModeAdma1)
#endif
    )
    {
        error = kStatus_InvalidArgument;
    }
    else if (((dmaMode == kSDHC_DmaModeAdma2) && (((uint32_t)startAddress % SDHC_ADMA2_LENGTH_ALIGN) != 0UL))
#if defined FSL_SDHC_ENABLE_ADMA1
             || ((dmaMode == kSDHC_DmaModeAdma1) && (((uint32_t)startAddress % SDHC_ADMA1_LENGTH_ALIGN) != 0UL))
#endif
    )
    {
        error = kStatus_SDHC_DMADataBufferAddrNotAlign;
    }
    else
    {
#if defined FSL_SDHC_ENABLE_ADMA1
        if (dmaMode == kSDHC_DmaModeAdma1)
        {
            /*
             * Add non aligned access support ,user need make sure your buffer size is big
             * enough to hold the data,in other words,user need make sure the buffer size
             * is 4 byte aligned
             */
            if (dataBytes % sizeof(uint32_t) != 0U)
            {
                dataBytes +=
                    sizeof(uint32_t) - (dataBytes % sizeof(uint32_t)); /* make the data length as word-aligned */
            }

            /* Check if ADMA descriptor's number is enough. */
            entries = ((dataBytes / SDHC_ADMA1_DESCRIPTOR_MAX_LENGTH_PER_ENTRY) + 1U);
            /* ADMA1 needs two descriptors to finish a transfer */
            entries <<= 1U;
            if (entries > ((tableWords * sizeof(uint32_t)) / sizeof(sdhc_adma1_descriptor_t)))
            {
                error = kStatus_OutOfRange;
            }
            else
            {
                adma1EntryAddress = (sdhc_adma1_descriptor_t *)(uint32_t)(table);
                for (i = 0U; i < entries; i += 2U)
                {
                    /* Each descriptor for ADMA1 is 32-bit in length */
                    if ((dataBytes - ((uint32_t)startAddress - (uint32_t)data)) <=
                        SDHC_ADMA1_DESCRIPTOR_MAX_LENGTH_PER_ENTRY)
                    {
                        /* The last piece of data, setting end flag in descriptor */
                        adma1EntryAddress[i] = ((uint32_t)(dataBytes - ((uint32_t)startAddress - (uint32_t)data))
                                                << SDHC_ADMA1_DESCRIPTOR_LENGTH_SHIFT);
                        adma1EntryAddress[i] |= (uint32_t)kSDHC_Adma1DescriptorTypeSetLength;
                        adma1EntryAddress[i + 1U] = (uint32_t)(startAddress);
                        adma1EntryAddress[i + 1U] |=
                            ((uint32_t)kSDHC_Adma1DescriptorTypeTransfer | (uint32_t)kSDHC_Adma1DescriptorEndFlag);
                    }
                    else
                    {
                        adma1EntryAddress[i] = ((uint32_t)SDHC_ADMA1_DESCRIPTOR_MAX_LENGTH_PER_ENTRY
                                                << SDHC_ADMA1_DESCRIPTOR_LENGTH_SHIFT);
                        adma1EntryAddress[i] |= (uint32_t)kSDHC_Adma1DescriptorTypeSetLength;
                        adma1EntryAddress[i + 1U] = ((uint32_t)(startAddress));
                        adma1EntryAddress[i + 1U] |= (uint32_t)kSDHC_Adma1DescriptorTypeTransfer;
                        startAddress += SDHC_ADMA1_DESCRIPTOR_MAX_LENGTH_PER_ENTRY / sizeof(uint32_t);
                    }
                }

                /* When use ADMA, disable simple DMA */
                base->DSADDR  = 0U;
                base->ADSADDR = (uint32_t)table;
            }
        }
        else
#endif /* FSL_SDHC_ENABLE_ADMA1 */
            if (dmaMode == kSDHC_DmaModeAdma2)
        {
            /*
             * Add non aligned access support ,user need make sure your buffer size is big
             * enough to hold the data,in other words,user need make sure the buffer size
             * is 4 byte aligned
             */
            if (dataBytes % sizeof(uint32_t) != 0U)
            {
                dataBytes +=
                    sizeof(uint32_t) - (dataBytes % sizeof(uint32_t)); /* make the data length as word-aligned */
            }

            /* Check if ADMA descriptor's number is enough. */
            entries = ((dataBytes / SDHC_ADMA2_DESCRIPTOR_MAX_LENGTH_PER_ENTRY) + 1U);
            if (entries > ((tableWords * sizeof(uint32_t)) / sizeof(sdhc_adma2_descriptor_t)))
            {
                error = kStatus_OutOfRange;
            }
            else
            {
                adma2EntryAddress = (sdhc_adma2_descriptor_t *)(uint32_t)(table);
                for (i = 0U; i < entries; i++)
                {
                    /* Each descriptor for ADMA2 is 64-bit in length */
                    if ((dataBytes - ((uint32_t)startAddress - (uint32_t)data)) <=
                        SDHC_ADMA2_DESCRIPTOR_MAX_LENGTH_PER_ENTRY)
                    {
                        /* The last piece of data, setting end flag in descriptor */
                        adma2EntryAddress[i].address   = startAddress;
                        adma2EntryAddress[i].attribute = ((dataBytes - ((uint32_t)startAddress - (uint32_t)data))
                                                          << SDHC_ADMA2_DESCRIPTOR_LENGTH_SHIFT);
                        adma2EntryAddress[i].attribute |=
                            ((uint32_t)kSDHC_Adma2DescriptorTypeTransfer | (uint32_t)kSDHC_Adma2DescriptorEndFlag);
                    }
                    else
                    {
                        adma2EntryAddress[i].address = startAddress;
                        adma2EntryAddress[i].attribute =
                            (((SDHC_ADMA2_DESCRIPTOR_MAX_LENGTH_PER_ENTRY / sizeof(uint32_t)) * sizeof(uint32_t))
                             << SDHC_ADMA2_DESCRIPTOR_LENGTH_SHIFT);
                        adma2EntryAddress[i].attribute |= (uint32_t)kSDHC_Adma2DescriptorTypeTransfer;
                        startAddress += (SDHC_ADMA2_DESCRIPTOR_MAX_LENGTH_PER_ENTRY / sizeof(uint32_t));
                    }
                }

                /* When use ADMA, disable simple DMA */
                base->DSADDR  = 0U;
                base->ADSADDR = (uint32_t)table;
            }
        }
        else
        {
            /* Intentional empty */
        }
    }

    return error;
}

/*!
 * brief Transfers the command/data using a blocking method.
 *
 * This function waits until the command response/data is received or the SDHC encounters an error by polling the status
 * flag.
 * This function support non word align data addr transfer support, if data buffer addr is not align in DMA mode,
 * the API will continue finish the transfer by polling IO directly
 * The application must not call this API in multiple threads at the same time. Because of that this API doesn't support
 * the re-entry mechanism.
 *
 * note There is no need to call the API 'SDHC_TransferCreateHandle' when calling this API.
 *
 * param base SDHC peripheral base address.
 * param admaTable ADMA table address, can't be null if transfer way is ADMA1/ADMA2.
 * param admaTableWords ADMA table length united as words, can't be 0 if transfer way is ADMA1/ADMA2.
 * param transfer Transfer content.
 * retval kStatus_InvalidArgument Argument is invalid.
 * retval kStatus_SDHC_PrepareAdmaDescriptorFailed Prepare ADMA descriptor failed.
 * retval kStatus_SDHC_SendCommandFailed Send command failed.
 * retval kStatus_SDHC_TransferDataFailed Transfer data failed.
 * retval kStatus_Success Operate successfully.
 */
status_t SDHC_TransferBlocking(SDHC_Type *base, uint32_t *admaTable, uint32_t admaTableWords, sdhc_transfer_t *transfer)
{
    assert(transfer != NULL);

