MCUSec/IPEA/fw_samples/frdmk64f-sdk_v2.11.0/devices/MK64F12/drivers/fsl_sdhc.c
    status_t error = kStatus_Success;
    sdhc_dma_mode_t dmaMode =
        (sdhc_dma_mode_t)(uint8_t)((base->PROCTL & SDHC_PROCTL_DMAS_MASK) >> SDHC_PROCTL_DMAS_SHIFT);
    sdhc_command_t *command = transfer->command;
    sdhc_data_t *data       = transfer->data;

    /* make sure the cmd/block count is valid */
    if ((command == NULL) || ((data != NULL) && (data->blockCount > SDHC_MAX_BLOCK_COUNT)))
    {
        return kStatus_InvalidArgument;
    }

    /* Wait until command/data bus out of busy status. */
    while (IS_SDHC_FLAG_SET(SDHC_GetPresentStatusFlags(base), kSDHC_CommandInhibitFlag))
    {
    }
    while ((data != NULL) && (IS_SDHC_FLAG_SET(SDHC_GetPresentStatusFlags(base), kSDHC_DataInhibitFlag)))
    {
    }

    /* Update ADMA descriptor table according to different DMA mode(no DMA, ADMA1, ADMA2).*/
    if ((data != NULL) && (NULL != admaTable))
    {
        error = SDHC_SetAdmaTableConfig(base, (sdhc_dma_mode_t)dmaMode, admaTable, admaTableWords,
                                        (data->rxData != NULL ? data->rxData : data->txData),
                                        (data->blockCount * data->blockSize));
        /* in this situation , we disable the DMA instead of polling transfer mode */
        if (error != kStatus_Success)
        {
            dmaMode = (sdhc_dma_mode_t)kSDHC_DmaModeNo;
        }
    }

    if (data != NULL)
    {
        SDHC_ClearInterruptStatusFlags(
            base,
            (uint32_t)(dmaMode == kSDHC_DmaModeNo ? kSDHC_DataFlag : kSDHC_DataDMAFlag) | (uint32_t)kSDHC_CommandFlag);
    }
    else
    {
        SDHC_ClearInterruptStatusFlags(base, kSDHC_CommandFlag);
    }

    /* Send command and receive data. */
    SDHC_StartTransfer(base, command, data, (sdhc_dma_mode_t)dmaMode);

    error = SDHC_SendCommandBlocking(base, command);
    if (kStatus_Success != error)
    {
        return error;
    }

    if (data != NULL)
    {
        error = SDHC_TransferDataBlocking((sdhc_dma_mode_t)dmaMode, base, data);
        if (kStatus_Success != error)
        {
            return error;
        }
    }

    return kStatus_Success;
}

/*!
 * brief Creates the SDHC handle.
 *
 * param base SDHC peripheral base address.
 * param handle SDHC handle pointer.
 * param callback Structure pointer to contain all callback functions.
 * param userData Callback function parameter.
 */
void SDHC_TransferCreateHandle(SDHC_Type *base,
                               sdhc_handle_t *handle,
                               const sdhc_transfer_callback_t *callback,
                               void *userData)
{
    assert(handle != NULL);
    assert(callback != NULL);

    /* Zero the handle. */
    (void)memset(handle, 0, sizeof(*handle));

    /* Set the callback. */
    handle->callback.CardInserted     = callback->CardInserted;
    handle->callback.CardRemoved      = callback->CardRemoved;
    handle->callback.SdioInterrupt    = callback->SdioInterrupt;
    handle->callback.SdioBlockGap     = callback->SdioBlockGap;
    handle->callback.TransferComplete = callback->TransferComplete;
    handle->userData                  = userData;

    /* Save the handle in global variables to support the double weak mechanism. */
    s_sdhcHandle[SDHC_GetInstance(base)] = handle;

    /* save IRQ handler */
    s_sdhcIsr = SDHC_TransferHandleIRQ;

    (void)EnableIRQ(s_sdhcIRQ[SDHC_GetInstance(base)]);
}

/*!
 * brief Transfers the command/data using an interrupt and an asynchronous method.
 *
 * This function sends a command and data and returns immediately. It doesn't wait the transfer complete or encounter an
 * error.
 * This function support non word align data addr transfer support, if data buffer addr is not align in DMA mode,
 * the API will continue finish the transfer by polling IO directly
 * The application must not call this API in multiple threads at the same time. Because of that this API doesn't support
 * the re-entry mechanism.
 *
 * note Call the API 'SDHC_TransferCreateHandle' when calling this API.
 *
 * param base SDHC peripheral base address.
 * param handle SDHC handle.
 * param admaTable ADMA table address, can't be null if transfer way is ADMA1/ADMA2.
 * param admaTableWords ADMA table length united as words, can't be 0 if transfer way is ADMA1/ADMA2.
 * param transfer Transfer content.
 * retval kStatus_InvalidArgument Argument is invalid.
 * retval kStatus_SDHC_BusyTransferring Busy transferring.
 * retval kStatus_SDHC_PrepareAdmaDescriptorFailed Prepare ADMA descriptor failed.
 * retval kStatus_Success Operate successfully.
 */
status_t SDHC_TransferNonBlocking(
    SDHC_Type *base, sdhc_handle_t *handle, uint32_t *admaTable, uint32_t admaTableWords, sdhc_transfer_t *transfer)
{
    assert(transfer != NULL);

    sdhc_dma_mode_t dmaMode =
        (sdhc_dma_mode_t)(uint8_t)((base->PROCTL & SDHC_PROCTL_DMAS_MASK) >> SDHC_PROCTL_DMAS_SHIFT);
    status_t error          = kStatus_Success;
    sdhc_command_t *command = transfer->command;
    sdhc_data_t *data       = transfer->data;

    /* make sure cmd/block count is valid */
    if ((command == NULL) || ((data != NULL) && (data->blockCount > SDHC_MAX_BLOCK_COUNT)))
    {
        return kStatus_InvalidArgument;
    }

    /* Wait until command/data bus out of busy status. */
    if ((IS_SDHC_FLAG_SET(SDHC_GetPresentStatusFlags(base), kSDHC_CommandInhibitFlag)) ||
        ((data != NULL) && (IS_SDHC_FLAG_SET(SDHC_GetPresentStatusFlags(base), kSDHC_DataInhibitFlag))))
    {
        return kStatus_SDHC_BusyTransferring;
    }

    /* Update ADMA descriptor table according to different DMA mode(no DMA, ADMA1, ADMA2).*/
    if ((data != NULL) && (NULL != admaTable))
    {
        error = SDHC_SetAdmaTableConfig(base, dmaMode, admaTable, admaTableWords,
                                        (data->rxData != NULL ? data->rxData : data->txData),
                                        (data->blockCount * data->blockSize));
        /* in this situation , we disable the DMA instead of polling transfer mode */
        if (error != kStatus_Success)
        {
            /* change to polling mode */
            dmaMode = kSDHC_DmaModeNo;
        }
    }

    /* Save command and data into handle before transferring. */
    handle->command = command;
    handle->data    = data;
    /* transferredWords will only be updated in ISR when transfer way is DATAPORT. */
    handle->transferredWords = 0U;

