MCUSec/IPEA/fw_samples/frdmk64f-sdk_v2.11.0/devices/MK64F12/drivers/fsl_sdhc.c
    /* enable interrupt per transfer request */
    if (handle->data != NULL)
    {
        SDHC_ClearInterruptStatusFlags(
            base,
            (uint32_t)(dmaMode == kSDHC_DmaModeNo ? kSDHC_DataFlag : kSDHC_DataDMAFlag) | (uint32_t)kSDHC_CommandFlag);
        SDHC_EnableInterruptSignal(base, (uint32_t)(dmaMode == kSDHC_DmaModeNo ? kSDHC_DataFlag : kSDHC_DataDMAFlag) |
                                             (uint32_t)kSDHC_CommandFlag);
    }
    else
    {
        SDHC_ClearInterruptStatusFlags(base, kSDHC_CommandFlag);
        SDHC_EnableInterruptSignal(base, kSDHC_CommandFlag);
    }

    SDHC_StartTransfer(base, command, data, dmaMode);

    return kStatus_Success;
}

/*!
 * brief IRQ handler for the SDHC.
 *
 * This function deals with the IRQs on the given host controller.
 *
 * param base SDHC peripheral base address.
 * param handle SDHC handle.
 */
void SDHC_TransferHandleIRQ(SDHC_Type *base, sdhc_handle_t *handle)
{
    assert(handle != NULL);

    uint32_t interruptFlags;

    interruptFlags = SDHC_GetEnabledInterruptStatusFlags(base);

    if (IS_SDHC_FLAG_SET(interruptFlags, kSDHC_CardDetectFlag))
    {
        SDHC_TransferHandleCardDetect(base, handle, interruptFlags);
    }
    if (IS_SDHC_FLAG_SET(interruptFlags, kSDHC_CommandFlag))
    {
        SDHC_TransferHandleCommand(base, handle, interruptFlags);
    }
    if (IS_SDHC_FLAG_SET(interruptFlags, kSDHC_DataFlag))
    {
        SDHC_TransferHandleData(base, handle, interruptFlags);
    }
    if (IS_SDHC_FLAG_SET(interruptFlags, kSDHC_CardInterruptFlag))
    {
        SDHC_TransferHandleSdioInterrupt(base, handle);
    }
    if (IS_SDHC_FLAG_SET(interruptFlags, kSDHC_BlockGapEventFlag))
    {
        SDHC_TransferHandleSdioBlockGap(base, handle);
    }

    SDHC_ClearInterruptStatusFlags(base, interruptFlags);
}

#if defined(SDHC)
void SDHC_DriverIRQHandler(void);
__attribute__((annotate("interruptHandler")))
void SDHC_DriverIRQHandler(void)
{
    assert(s_sdhcHandle[0] != NULL);

    s_sdhcIsr(SDHC, s_sdhcHandle[0]);
    SDK_ISR_EXIT_BARRIER;
}
#endif
